CR2W/env/fx/gameplay/mutation/mutation_10/euphoria_env.env.patch
 1 file changed, 2 insertions(+), 2 deletions(-)

diff --git 1.32/fx/gameplay/mutation/mutation_10/euphoria_env.env.txt 4.00/fx/gameplay/mutation/mutation_10/euphoria_env.env.txt
index b347d73..cae8e4f 100644
--- 1.32/fx/gameplay/mutation/mutation_10/euphoria_env.env.txt
+++ 4.00/fx/gameplay/mutation/mutation_10/euphoria_env.env.txt
@@ -48,8 +48,8 @@
                                 lue (Float) : 0.6775
                                 rveTypeL (Uint16) : 1
                                 rveTypeR (Uint16) : 1
-                    balanceMap0 (soft:CBitmapTexture) : fx/gameplay/mutation/mutation_10/euphoria_bm.xbm
-                    balanceMap1 (soft:CBitmapTexture) : fx/gameplay/mutation/mutation_10/euphoria_bm.xbm
+                    balanceMap0 (handle:CBitmapTexture) : fx/gameplay/mutation/mutation_10/euphoria_bm.xbm
+                    balanceMap1 (handle:CBitmapTexture) : fx/gameplay/mutation/mutation_10/euphoria_bm.xbm
                 m_ssaoMS (CEnvMSSSAOParameters)
                     activated (Bool) : false
                     combineResolutionsBeforeBlur (Bool) : false
