CR2W/env/fx/gameplay/mutation/mutation_7/mtn_7_adrenaline_drop_env.env.patch
 1 file changed, 2 insertions(+), 2 deletions(-)

diff --git 1.32/fx/gameplay/mutation/mutation_7/mtn_7_adrenaline_drop_env.env.txt 4.00/fx/gameplay/mutation/mutation_7/mtn_7_adrenaline_drop_env.env.txt
index c4cc5e8..70685bd 100644
--- 1.32/fx/gameplay/mutation/mutation_7/mtn_7_adrenaline_drop_env.env.txt
+++ 4.00/fx/gameplay/mutation/mutation_7/mtn_7_adrenaline_drop_env.env.txt
@@ -18,8 +18,8 @@
                                 lue (Float) : 0.9511
                                 rveTypeL (Uint16) : 1
                                 rveTypeR (Uint16) : 1
-                    balanceMap0 (soft:CBitmapTexture) : fx/gameplay/mutation/mutation_7/adrenaline_drop_bm.xbm
-                    balanceMap1 (soft:CBitmapTexture) : fx/gameplay/mutation/mutation_7/adrenaline_drop_bm.xbm
+                    balanceMap0 (handle:CBitmapTexture) : fx/gameplay/mutation/mutation_7/adrenaline_drop_bm.xbm
+                    balanceMap1 (handle:CBitmapTexture) : fx/gameplay/mutation/mutation_7/adrenaline_drop_bm.xbm
                 m_ssaoMS (CEnvMSSSAOParameters)
                     activated (Bool) : false
                     combineResolutionsBeforeBlur (Bool) : false
