CR2W/w2l/dlc/bob/data/levels/bob/quests/minor_quests/mq7023_mutations/ruins_traps/entities/bolt_puzzle.w2l.patch
 1 file changed, 1 insertion(+), 1 deletion(-)

diff --git 1.32/dlc/bob/data/levels/bob/quests/minor_quests/mq7023_mutations/ruins_traps/entities/bolt_puzzle.w2l.txt 4.00/dlc/bob/data/levels/bob/quests/minor_quests/mq7023_mutations/ruins_traps/entities/bolt_puzzle.w2l.txt
index 3c8c6c3..0948785 100644
--- 1.32/dlc/bob/data/levels/bob/quests/minor_quests/mq7023_mutations/ruins_traps/entities/bolt_puzzle.w2l.txt
+++ 4.00/dlc/bob/data/levels/bob/quests/minor_quests/mq7023_mutations/ruins_traps/entities/bolt_puzzle.w2l.txt
@@ -978,7 +978,7 @@
                         graphPositionY (Int16) : 113
                         boundingBox (Box)
                             Min (Vector)
-                                X (Float) : 143.6358
+                                X (Float) : 143.6357
                                 Y (Float) : -1593.5860
                                 Z (Float) : -40.1737
                                 W (Float) : 1.0000
