CR2W/w2l/dlc/bob/data/levels/bob/quests/minor_quests/mq7023_mutations/ruins_traps/entities/spikes_puzzle.w2l.patch
 1 file changed, 14 insertions(+), 14 deletions(-)

diff --git 1.32/dlc/bob/data/levels/bob/quests/minor_quests/mq7023_mutations/ruins_traps/entities/spikes_puzzle.w2l.txt 4.00/dlc/bob/data/levels/bob/quests/minor_quests/mq7023_mutations/ruins_traps/entities/spikes_puzzle.w2l.txt
index 121acdb..19d3a3d 100644
--- 1.32/dlc/bob/data/levels/bob/quests/minor_quests/mq7023_mutations/ruins_traps/entities/spikes_puzzle.w2l.txt
+++ 4.00/dlc/bob/data/levels/bob/quests/minor_quests/mq7023_mutations/ruins_traps/entities/spikes_puzzle.w2l.txt
@@ -43621,12 +43621,12 @@
                     box5 (Float) : 0.0000
                     pathHash (String) : ""
                 1 (CSectorDataResource)
-                    box0 (Float) : -2.9435
-                    box1 (Float) : -2.1003
-                    box2 (Float) : -1.1762
-                    box3 (Float) : 2.9432
-                    box4 (Float) : 2.0928
-                    box5 (Float) : 7.7191
+                    box0 (Float) : -2.9388
+                    box1 (Float) : -2.0926
+                    box2 (Float) : -1.1663
+                    box3 (Float) : 2.9407
+                    box4 (Float) : 2.0891
+                    box5 (Float) : 7.7104
                     pathHash (String) : "dlc/bob/data/environment/terrain_surroundings/rock_debris/bob_rock_cliff_a_moss.w2mesh"
                 2 (CSectorDataResource)
                     box0 (Float) : -1.9154
@@ -43640,19 +43640,19 @@
                 0 (CSectorDataObject)
                     type (Uint8) : 1
                     flags (Uint8) : 0
-                    radius (Uint16) : 200
+                    radius (Uint16) : 450
                     offset (Uint64) : 0
-                    positionX (Float) : 69.8132
-                    positionY (Float) : -1520.3500
-                    positionZ (Float) : -35.3964
+                    positionX (Float) : 69.8154
+                    positionY (Float) : -1520.3490
+                    positionZ (Float) : -35.3993
                 1 (CSectorDataObject)
                     type (Uint8) : 2
                     flags (Uint8) : 0
-                    radius (Uint16) : 200
+                    radius (Uint16) : 450
                     offset (Uint64) : 64
-                    positionX (Float) : 69.8132
-                    positionY (Float) : -1520.3500
-                    positionZ (Float) : -35.3964
+                    positionX (Float) : 69.8154
+                    positionY (Float) : -1520.3490
+                    positionZ (Float) : -35.3993
                 2 (CSectorDataObject)
                     type (Uint8) : 1
                     flags (Uint8) : 0
