CR2W/w2mesh/dlc/bob/data/fx/gameplay/mutation/mutation_7/sphere_double_sided_mut7.w2mesh.patch
 1 file changed, 3 insertions(+), 1 deletion(-)

diff --git 1.32/dlc/bob/data/fx/gameplay/mutation/mutation_7/sphere_double_sided_mut7.w2mesh.txt 4.00/dlc/bob/data/fx/gameplay/mutation/mutation_7/sphere_double_sided_mut7.w2mesh.txt
index 53b34ac..4a16240 100644
--- 1.32/dlc/bob/data/fx/gameplay/mutation/mutation_7/sphere_double_sided_mut7.w2mesh.txt
+++ 4.00/dlc/bob/data/fx/gameplay/mutation/mutation_7/sphere_double_sided_mut7.w2mesh.txt
@@ -7,7 +7,7 @@
                     X (Float) : -1.0000
                     Y (Float) : -1.0000
                     Z (Float) : -1.0000
-                    W (Float) : 1.0000
+                    W (Float) : 0.0000
                 Max (Vector)
                     X (Float) : 1.0000
                     Y (Float) : 1.0000
@@ -42,6 +42,8 @@
                 vertexBufferSize (Uint32) : 22368
                 indexBufferSize (Uint32) : 11520
                 indexBufferOffset (Uint32) : 22528
+                blasBuffer (DeferredDataBuffer)
+                    Bufferdata (Int16) : 0
             internalVersion (Uint8) : 2
             ChunkgroupIndeces (CBufferVLQInt32:CPaddedBuffer:CUInt16)
                 0 (CPaddedBuffer:CUInt16)
