CR2W/w2mesh/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_01.w2mesh.patch
 1 file changed, 3 insertions(+), 6 deletions(-)

diff --git 1.32/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_01.w2mesh.txt 4.00/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_01.w2mesh.txt
index 882665e..0fde2b3 100644
--- 1.32/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_01.w2mesh.txt
+++ 4.00/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_01.w2mesh.txt
@@ -9,7 +9,7 @@
                     X (Float) : -0.4492
                     Y (Float) : -0.3565
                     Z (Float) : -0.0009
-                    W (Float) : 1.0000
+                    W (Float) : 0.0000
                 Max (Vector)
                     X (Float) : 0.4493
                     Y (Float) : 0.2783
@@ -57,11 +57,6 @@
                     firstIndex (Uint32) : 11067
             isStatic (Bool) : true
             cookedData (SMeshCookedData)
-                collisionInitPositionOffset (Vector)
-                    X (Float) : 0.0000
-                    Y (Float) : 0.0000
-                    Z (Float) : 10578590.0000
-                    W (Float) : 0.0000
                 renderLODs (array:Float)
                     1 (Float) : 15.0000
                     2 (Float) : 25.0000
@@ -81,6 +76,8 @@
                 vertexBufferSize (Uint32) : 77680
                 indexBufferSize (Uint32) : 47238
                 indexBufferOffset (Uint32) : 77824
+                blasBuffer (DeferredDataBuffer)
+                    Bufferdata (Int16) : 0
             internalVersion (Uint8) : 2
             ChunkgroupIndeces (CBufferVLQInt32:CPaddedBuffer:CUInt16)
                 0 (CPaddedBuffer:CUInt16)
