CR2W/w2mesh/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_02.w2mesh.patch
 1 file changed, 3 insertions(+), 6 deletions(-)

diff --git 1.32/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_02.w2mesh.txt 4.00/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_02.w2mesh.txt
index 259b33d..a02d9c5 100644
--- 1.32/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_02.w2mesh.txt
+++ 4.00/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_02.w2mesh.txt
@@ -8,7 +8,7 @@
                     X (Float) : -0.0476
                     Y (Float) : -0.0358
                     Z (Float) : -0.9698
-                    W (Float) : 1.0000
+                    W (Float) : 0.0000
                 Max (Vector)
                     X (Float) : 0.3920
                     Y (Float) : 0.2959
@@ -50,11 +50,6 @@
                     firstIndex (Uint32) : 15240
             isStatic (Bool) : true
             cookedData (SMeshCookedData)
-                collisionInitPositionOffset (Vector)
-                    X (Float) : 0.0000
-                    Y (Float) : 0.0000
-                    Z (Float) : 29634820000.0000
-                    W (Float) : 0.0000
                 renderLODs (array:Float)
                     1 (Float) : 6.0000
                     2 (Float) : 12.0000
@@ -74,6 +69,8 @@
                 vertexBufferSize (Uint32) : 106160
                 indexBufferSize (Uint32) : 64500
                 indexBufferOffset (Uint32) : 106496
+                blasBuffer (DeferredDataBuffer)
+                    Bufferdata (Int16) : 0
             internalVersion (Uint8) : 2
             ChunkgroupIndeces (CBufferVLQInt32:CPaddedBuffer:CUInt16)
                 0 (CPaddedBuffer:CUInt16)
