CR2W/w2mesh/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_03.w2mesh.patch
 1 file changed, 3 insertions(+), 6 deletions(-)

diff --git 1.32/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_03.w2mesh.txt 4.00/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_03.w2mesh.txt
index 74ac50e..b114fe7 100644
--- 1.32/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_03.w2mesh.txt
+++ 4.00/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_03.w2mesh.txt
@@ -8,7 +8,7 @@
                     X (Float) : -0.3942
                     Y (Float) : -0.0341
                     Z (Float) : -0.9690
-                    W (Float) : 1.0000
+                    W (Float) : 0.0000
                 Max (Vector)
                     X (Float) : 0.0596
                     Y (Float) : 0.2985
@@ -51,11 +51,6 @@
                     firstIndex (Uint32) : 15261
             isStatic (Bool) : true
             cookedData (SMeshCookedData)
-                collisionInitPositionOffset (Vector)
-                    X (Float) : 0.0000
-                    Y (Float) : 0.0000
-                    Z (Float) : 29634230000.0000
-                    W (Float) : 0.0000
                 renderLODs (array:Float)
                     1 (Float) : 6.0000
                     2 (Float) : 12.0000
@@ -75,6 +70,8 @@
                 vertexBufferSize (Uint32) : 106400
                 indexBufferSize (Uint32) : 64488
                 indexBufferOffset (Uint32) : 106496
+                blasBuffer (DeferredDataBuffer)
+                    Bufferdata (Int16) : 0
             internalVersion (Uint8) : 2
             ChunkgroupIndeces (CBufferVLQInt32:CPaddedBuffer:CUInt16)
                 0 (CPaddedBuffer:CUInt16)
