CR2W/w2mesh/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_04.w2mesh.patch
 1 file changed, 3 insertions(+), 1 deletion(-)

diff --git 1.32/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_04.w2mesh.txt 4.00/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_04.w2mesh.txt
index 64f78c9..0f07a62 100644
--- 1.32/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_04.w2mesh.txt
+++ 4.00/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_04.w2mesh.txt
@@ -8,7 +8,7 @@
                     X (Float) : -0.0061
                     Y (Float) : -0.0114
                     Z (Float) : -0.1608
-                    W (Float) : 1.0000
+                    W (Float) : 0.0000
                 Max (Vector)
                     X (Float) : 0.2939
                     Y (Float) : 0.2421
@@ -74,6 +74,8 @@
                 vertexBufferSize (Uint32) : 94488
                 indexBufferSize (Uint32) : 57864
                 indexBufferOffset (Uint32) : 95232
+                blasBuffer (DeferredDataBuffer)
+                    Bufferdata (Int16) : 0
             internalVersion (Uint8) : 2
             ChunkgroupIndeces (CBufferVLQInt32:CPaddedBuffer:CUInt16)
                 0 (CPaddedBuffer:CUInt16)
