CR2W/w2mesh/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_05.w2mesh.patch
 1 file changed, 7 insertions(+), 5 deletions(-)

diff --git 1.32/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_05.w2mesh.txt 4.00/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_05.w2mesh.txt
index 8c59384..dfa0e79 100644
--- 1.32/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_05.w2mesh.txt
+++ 4.00/dlc/bob/data/items/quest_items/mq7023/model/mq7023_item__mutation_contraption_05.w2mesh.txt
@@ -7,7 +7,7 @@
                     X (Float) : -0.1248
                     Y (Float) : -0.0518
                     Z (Float) : -0.0289
-                    W (Float) : 1.0000
+                    W (Float) : 0.0000
                 Max (Vector)
                     X (Float) : 0.1244
                     Y (Float) : 0.1037
@@ -22,10 +22,10 @@
             isStatic (Bool) : true
             cookedData (SMeshCookedData)
                 collisionInitPositionOffset (Vector)
-                    X (Float) : 0.0000
-                    Y (Float) : 0.0000
-                    Z (Float) : 143506400000000000000000000000.0000
-                    W (Float) : 0.0000
+                    X (Float) : -0.0002
+                    Y (Float) : 0.0260
+                    Z (Float) : 0.1060
+                    W (Float) : 1.0000
                 renderLODs (array:Float)
                 renderChunks (array:Uint8) : # array:Uint8
                 renderBuffer (DeferredDataBuffer)
@@ -43,6 +43,8 @@
                 vertexBufferSize (Uint32) : 4608
                 indexBufferSize (Uint32) : 2124
                 indexBufferOffset (Uint32) : 5120
+                blasBuffer (DeferredDataBuffer)
+                    Bufferdata (Int16) : 0
             internalVersion (Uint8) : 2
             ChunkgroupIndeces (CBufferVLQInt32:CPaddedBuffer:CUInt16)
                 0 (CPaddedBuffer:CUInt16)
