CR2W/w2mesh/fx/gameplay/mutation/mutation_10/smoke_mesh.w2mesh.patch
 1 file changed, 3 insertions(+), 1 deletion(-)

diff --git 1.32/fx/gameplay/mutation/mutation_10/smoke_mesh.w2mesh.txt 4.00/fx/gameplay/mutation/mutation_10/smoke_mesh.w2mesh.txt
index 17feca2..6954549 100644
--- 1.32/fx/gameplay/mutation/mutation_10/smoke_mesh.w2mesh.txt
+++ 4.00/fx/gameplay/mutation/mutation_10/smoke_mesh.w2mesh.txt
@@ -7,7 +7,7 @@
                     X (Float) : -0.7994
                     Y (Float) : -0.3481
                     Z (Float) : -0.6859
-                    W (Float) : 1.0000
+                    W (Float) : 0.0000
                 Max (Vector)
                     X (Float) : 0.7994
                     Y (Float) : 0.3481
@@ -42,6 +42,8 @@
                 vertexBufferSize (Uint32) : 960
                 indexBufferSize (Uint32) : 360
                 indexBufferOffset (Uint32) : 1024
+                blasBuffer (DeferredDataBuffer)
+                    Bufferdata (Int16) : 0
             internalVersion (Uint8) : 2
             ChunkgroupIndeces (CBufferVLQInt32:CPaddedBuffer:CUInt16)
                 0 (CPaddedBuffer:CUInt16)
